{
    "1": "There was an error while performing this action, please try again",
    "2": "Data does not exist",
    "3": "Duplicate record found",
    "4": "Incorrect credential",
    "5": "Username already exists",
    "6": "Password does not match",
    "7": "Your account is not activated",
    "8": "Your organisation is yet not approved",
    "9": "Registration number already exists",
    "10": "Invalid Username",
    "11": "Existing password is incorrect",
    "12": "Incorrect OTP",
    "13": "Incorrect URL",
    "14": "Unauthorized to perform action as user verification failed",
    "15": "Unauthorized to perform action as user verification failed",
    "16": "Invalid data found",
    "17": "Internal validation",
    "18": "Incorrect OTP",
    "19": "This subdomain has already been taken",
    "20": "This company name is invalid",
    "21": "Invoice not found",
    "22": "You are not allowed to perform this action",
    "23": "Your attendance policy does not allow you to clock-in & out from web app",
    "24": "Your attendance policy does not allow you to clock-in & out from this location due to IP restrictions",
    "25": "You do not have access rights for this request",
    "26": "You already have an active subscription, please purchase add-ons",
    "27": "Reverifying...",
    "28": "Help scount verification failed.",
    "29": "Invalid consumer app key",
    "E0000": "Success",
    "E1010": "You have already registered with this work email",
    "E1020": "You have already registered with this mobile number",
    "E1030": "Our data system is temporarily unavailable",
    "E1040": "Issue found while saving this data, please try again",
    "E1050": "Something looks fishy, please check if its the email or the password 👀",
    "E1060": "This subdomain has already been taken",
    "E1070": "Location name must be unique, you already have a location with this name",
    "E1080": "Issue found while deleting this data, please try again",
    "E1090": "This account has already been verified",
    "E1100": "This office location cannot be deleted as employees are assigned to this location",
    "E1110": "Employee's email is already registered with this company",
    "E1120": "Employee's mobile number is already registered with this company",
    "E1130": "Trial already activated & default permissions have been added",
    "E1140": "Invalid email",
    "E1150": "Employee does not exist",
    "E1160": "Please enter correct existing password",
    "E1170": "Please verify your account",
    "E1180": "Password reset link has expired",
    "E1190": "User email already registerd",
    "E1200": "User mobile already registerd",
    "E1210": "Inactive subscription exists",
    "E1220": "Company's configuration is pending completion",
    "E1230": "Invalid Employee",
    "E1240": "There was an error while performing this action, please try again",
    "E1250": "Reporting location needs to be assigned",
    "E1260": "Business unit name must be unique, you already have a business unit with this name",
    "E1270": "This data cannot be deleted as employees are assigned to it",
    "E1280": "Team name must be unique, you already have a team with this name",
    "E1290": "Designation name must be unique, you already have a designation with this name",
    "E1300": "You must set one of your bank account details as default for payroll",
    "E1310": "You cannot delete your default bank account details",
    "E1320": "You have already added this skill",
    "E1330": "You have already added this language",
    "E1340": "Company code is invalid, please reach out to your HR for a valid company code",
    "E1350": "Mobile number or emailid verification failed",
    "E1360": "You have already added this interest",
    "E1370": "You have already added this movie",
    "E1380": "You have already added this music",
    "E1390": "You have already added this book",
    "E1400": "Shift name must be unique, you already have a shift with this name",
    "E1410": "Clock-in method name must be unique, you already have a clock-in method with this name",
    "E1420": "OTP already verified",
    "E1430": "Attendance policy name must be unique, you already have an attendance policy with this name",
    "E1440": "Extra time name must be unique, you already have an extra time with this name",
    "E1450": "Default shift is not assigned to you",
    "E1460": "Your attendance policy does not allow you to clock-in & out from this location due to IP restrictions",
    "E1470": "Probation period name must be unique, you already have a probation period with this name",
    "E1480": "Approval workflow name must be unique, you already have an approval workflow with this name",
    "E1490": "Weekly off policy name must be unique, you already have a weekly off policy with this name",
    "E1500": "You cannot disable this leave type, some leave policies are actively using it",
    "E1510": "Leave policy name must be unique, you already have a leave policy with this name",
    "E1520": "Leave name must be unique, you have used this name in this or some other policy",
    "E1530": "Grade name must be unique, you already have a grade with this name",
    "E1540": "Employee ID is already assigned to an employee",
    "E1550": "Similar request is already pending approval",
    "E1560": "Code name or code id already exists",
    "E1570": "Department name must be unique, you already have a department with this name",
    "E1580": "An address is already marked as primary address for this employee",
    "E1590": "An address is already marked as secondary address for this employee",
    "E1600": "Details for this contact type already exists",
    "E1610": "Primay address already exist for this subscription",
    "E1620": "Secondary address already exist for this subscription",
    "E1630": "Authentication failed",
    "E1640": "Company's subscription is in-active",
    "E1650": "Code length must greater than or equal to 1",
    "E1660": "Request has already been approved",
    "E1670": "Default bank details cannot be deleted",
    "E1680": "Holiday plan name must be unique, you already have a holiday plan with this name",
    "E1690": "You are unauthorized to perform this action",
    "E1700": "Your company has used all available seats",
    "E1710": "Password reset link has expired",
    "E1720": "Company's leave cycle has not been defined",
    "E1721": "Salary component name already exists.",
    "E1722": "Salary structure exists with this salary component",
    "E1723": "Salary structure name must be unique, you already have a salary structure with this name",
    "E1724": "Structure can't be deleted as it is assigned to employee(s)",
    "E1725": "Account number already exists",
    "E1780": "Leave already applied for this period",
    "E1790": "Clubbing not allowed",
    "E1800": "You cannot apply a leave as you have reached the maximum allowed leaves limit",
    "E1810": "You cannot apply a leave as you have reached consecutive leaves allowed limit",
    "E1820": "Future dated leaves are not allowed in your leave policy",
    "E1830": "Past dated leaves are not allowed in your leave policy",
    "E1840": "You are not allowed to apply for leaves in excess of available leave balance",
    "E1850": "You cannot have cyclic or looped departments",
    "E1860": "Attachment is required",
    "E1870": "You are not allowed to apply for half day's leave request",
    "E1880": "You have reached the maximum allowed hourly leave for this day",
    "E1890": "WFH/ OD request already applied for this period",
    "E1900": "You have insufficient comp-off leave balance",
    "E1910": "The employee you are gifting to does not have this leave type, please try gifting another leave type",
    "E1920": "The leave assigned to you does not have gifting enabled",
    "E1930": "You either don't have enough leave balance or you have exceeded the max leaves allowed to be gifted in a year",
    "E1940": "You have reached the maximum limit of leaves allowed during probation",
    "E1950": "You cannot mark attendance before or after your shift timings",
    "E1960": "Unauthorized to perform action as user verification failed",
    "E1970": "You have exceeded the monthly WFH/ OD requests",
    "E1980": "Work request not allowed",
    "E1990": "You cannot mark attendance twice within one minute",
    "E2000": "Data does not exist",
    "E2010": "Feature name must be unique",
    "E2020": "Feature ID must be unique",
    "E2030": "This signing authority cannot be deleted as it is already in use",
    "E2040": "Biometric device group name must be unique",
    "E2050": "Biometric device name must be unique",
    "E2060": "You have to apply for a certain minimum number of hours for a valid hourly leave",
    "E2070": "You have exceeded the maximum hours of hourly leave available in a month",
    "E2080": "Request is pending approval, you cannot update or delete bank details",
    "E2090": "You do not have access rights for this request",
    "E2110": "Your weekoff's leave balance is insufficient",
    "E2120": "A proforma invoice for this subsription already exists",
    "E2130": "This mobile device is already registered with another user",
    "E2140": "This mobile device is already registered with another user",
    "E2150": "Expense policy name must be unique, you already have a expense policy with this name",
    "E2160": "Expense policy has not been assigned to the employee",
    "E2170": "Expense policy has not been assigned to the employee",
    "E2180": "You Already have one bank as default",
    "E2190": "You are not allowed to apply for an advance request",
    "E2200": "Exit policy name must be unique, you already have an exit policy with this name",
    "E2210": "Exit reason name must be unique, you already have an exit reason with this name",
    "E2220": "This exit reason has been used and thus cannot be deleted",
    "E2230": "You cannot revoke an already compensated request",
    "E2240": "Expense policy has not been assigned",
    "E2250": "Request has already been compensated",
    "E2260": "Cannot delete this exit policy as it is assigned to an employee",
    "E2270": "You have already applied for an exit request",
    "E2280": "You cannot apply for a leave on a non-working day",
    "E2290": "Expense policy's spend limit has been exceeded",
    "E2300": "Folder name must be unique ",
    "E2310": "Document name must be unique",
    "E2320": "Duplicate user device id record in request",
    "E2330": "User device id already mapped with some other employee for same device or group",
    "E2340": "User device id already mapped with same employee for same device or group",
    "E2350": "You cannot delete this folder as there are one or multiple file/folders locked within it",
    "E2360": "Advance request is in pending",
    "E2370": "Letter category with the same name exists",
    "E2380": "Letter category with the same id exists",
    "E2390": "Variable category with the same name exists",
    "E2400": "Variable category with the same id exists",
    "E2410": "Letter variable with the same name or value exists",
    "E2420": "Letter variable with the same id exists",
    "E2430": "Page margin with the same page margin type exists",
    "E2440": "Payroll Config Require to set first",
    "E2450": "Letter template with the same name exists",
    "E2460": "This employee is already a signatory",
    "E2470": "This signatory has been used in letters, you can't delete.",
    "E2480": "Repayment Amount is Greater then Pending Amount",
    "E2490": "Already Applied for this month",
    "E2500": "FBP Name must be unique",
    "E2510": "Invalid refresh token",
    "E2520": "Refresh token has been expired",
    "E2530": "Request for this letter still in pending, you can't create for the same",
    "E2540": "Letter with same identifier already exists",
    "E2550": "You can't edit or delete the custom data once a employee has been used.",
    "E2560": "Custom data with same section name already exists.",
    "E2570": "Salary structure not assigned.",
    "E2580": "Expense category with the same id already exists",
    "E2590": "Expense category with the same category name already exists",
    "E2600": "Payroll Data/ Payslip are generated for selected month",
    "E2610": "Already request in pending",
    "E2620": "Expense sub-category with the same id already exists",
    "E2630": "Expense sub-category with the same name already exists",
    "E2640": "Payroll custom tag name must be unique",
    "E2650": "Already assign to employee",
    "E2660": "Discount coupon has been used",
    "E2670": "Discount coupon exists with the same coupon code",
    "E2680": "Duplicate records found",
    "E2690": "Employee is already in-active",
    "E2700": "Employee exists with Custom Payroll Tags",
    "E2710": "Exit date can not be null",
    "E2720": "Review form with this title already exists",
    "E2730": "Similar Data Found",
    "E2740": "Can't Assign before DOJ",
    "E2750": "Can't Assign before Payroll Cycle",
    "E2760": "Playslip generated for selected month",
    "E2770": "Unique Competency Name",
    "E2780": "Unique Review Structure Name",
    "E2790": "Form can't release untill all the participant submit their review",
    "E2800": "Please fill all required fields",
    "E2810": "Once the form has been opened for an employee, you can't edit the form",
    "E2820": "You can not delete this structure as it is linked to review form",
    "E2830": "Unit name can't be duplicate",
    "E2840": "Objective Unit Already used in Objective",
    "E2850": "Payslip generated for selected employee",
    "E2860": "Key Result Area should be in same quarter",
    "E2870": "Tax amount should be greater than or equal to Zero",
    "E2880": "Employee exists in payroll exception",
    "E2890": "This currecy is already exist",
    "E2900": "Invalid bill date",
    "E2910": "You can not revoke partially cmpensated request",
    "E2920": "Tag name must be unique",
    "E2930": "Competency link to review form",
    "E2940": "Mail template with the same name already exists",
    "E2950": "Pipeline with this title already exists",
    "E2960": "Mail template is attached with some configrutation, can't delete",
    "E2970": "Cannot delete this fnf policy as it is assigned to an employee",
    "E2980": "Fnf policy with this title already exists",
    "E2990": "Extra Time request already applied for this period",
    "E3000": "Invalid request code found",
    "E3010": "Cannot update this salary component as it is attached with salary structure",
    "E3020": "Cannot update this salary component as it is attached with extra payment/deduction",
    "E3030": "Cannot update this salary component as it is attached with fbp",
    "E3040": "Request is already processed",
    "E3050": "Assignments can't be deleted. Payroll data are generated",
    "E3060": "Employee VPF already exist",
    "E3070": "Employee taxsheet synced successfully",
    "E3080": "Error while fetching user detais",
    "E3090": "Error while fetching billing address",
    "E3100": "Assignments can't be deleted. Declaration requests submitted.",
    "E3110": "Assignments can't be deleted. FBP requests submitted.",
    "E3120": "Subscription renewal request is not created yet.",
    "E3130": "App version already exist in selected App Type.",
    "E3140": "Source Type with same name exist",
    "E3150": "Category with same name exist",
    "E3160": "Requistion with same name exist",
    "E3170": "Cannot change DOJ, you've already assigned attendance & leave polices",
    "E3180": "Activate trails link has expired",
    "E3190": "Trial extend link has expired",
    "E3200": "Trial already functional",
    "E3210": "Oops! Looks like some leave applications are still pending. Please take action on pending leave applications and retry.",
    "E3220": "Schema with same name already exist",
    "E3230": "Schema with this name doesn't exist",
    "E3240": "Schema defination not found , please check schemaid",
    "E3250": "Leave used somewhere else in clubbing or overutilization"
  }
  